# Strings

In [1]:
import pandas as pd 

data = {
    'names' : [
        'Sara Moreno 34',
        'jUAn GoMEz 23',
        'MarLon MENendez 28',
        'ReNE OBanDo 25',
        'AleJAndro obaNdo 24',
        pd.NA
    ]
}

In [2]:
df = pd.DataFrame(data)
df

                 names
0       Sara Moreno 34
1        jUAn GoMEz 23
2   MarLon MENendez 28
3       ReNE OBanDo 25
4  AleJAndro obaNdo 24
5                 <NA>

In [3]:
df['names'].str.lower()

0         sara moreno 34
1          juan gomez 23
2     marlon menendez 28
3         rene obando 25
4    alejandro obando 24
5                   <NA>
Name: names, dtype: object

In [4]:
df['names'].str.upper()

0         SARA MORENO 34
1          JUAN GOMEZ 23
2     MARLON MENENDEZ 28
3         RENE OBANDO 25
4    ALEJANDRO OBANDO 24
5                   <NA>
Name: names, dtype: object

In [5]:
df['names'].str.capitalize()

0         Sara moreno 34
1          Juan gomez 23
2     Marlon menendez 28
3         Rene obando 25
4    Alejandro obando 24
5                   <NA>
Name: names, dtype: object

In [7]:
df['names'].str.len()

0      14
1      13
2      18
3      14
4      19
5    <NA>
Name: names, dtype: object

In [8]:
df['names'].str.split(' ')

0         [Sara, Moreno, 34]
1          [jUAn, GoMEz, 23]
2     [MarLon, MENendez, 28]
3         [ReNE, OBanDo, 25]
4    [AleJAndro, obaNdo, 24]
5                       <NA>
Name: names, dtype: object